<?php

namespace app\technician\model;

class ServiceItems
{
    /**
     * 服务项目内容匹配
     * 例如 "Item01" => 如果 ["老鼠",0]则是没有标记Rmk,["老鼠",1]则是没有标记存在Rmk 所有的都需要手动配置
     * */
    public $items = [
        1 => [
            'Item01' => ['坐厕', 0],
            'Item02' => ['尿缸', 0],
            'Item03' => ['洗手盆', 0],
            'Item04' => ['电动清新机', 0],
            'Item05' => ['皂液机', 0],
            'Item06' => ['水剂喷机', 0],
            'Item07' => ['压缩罐喷机', 0],
            'Item08' => ['尿缸自动消毒器', 0],
            'Item09' => ['厕纸机', 0],
            'Item10' => ['抹手纸', 0],
            'Item11' => ['洗手间', 0],
            'Item12' => ['其他', 0],
            'Item13' => ['GOJO机', 0],
        ],
        2 => [
            "Item01" => ["老鼠", 1],
            "Item02" => ["蟑螂", 1],
            "Item03" => ["蚁", 0],
            "Item04" => ["果蝇", 1],
            "Item09" => ["苍蝇", 1],
            "Item06" => ["水剂喷机", 1],
            "Item07" => ["罐装灭虫喷机", 1],
            "Item10" => ["灭蝇灯", 1],
            "Item08" => ["其他", 1]
        ],
        3 => [
            "Item01" => ["蚊子", 0],
            "Item02" => ["苍蝇", 0],
            "Item03" => ["蟑螂", 0],
            "Item04" => ["跳蚤", 0],
            "Item05" => ["蛀虫", 0],
            "Item06" => ["其他", 0],
        ],
        4 => [
            "Item01" => ["白蚁", 0],
            "Item02" => ["跳蚤", 0],
            "Item03" => ["螨虫", 0],
            "Item04" => ["臭虫", 0],
            "Item05" => ["滞留", 0],
            "Item06" => ["焗雾", 0],
            "Item07" => ["勾枪", 0],
            "Item08" => ["空间消毒", 0],
            "Item09" => ["其他", 0],
        ]
    ];
}