<?php
// +----------------------------------------------------------------------
// | 服务评价问卷
// +----------------------------------------------------------------------

return [
    //服务评价表
    'questions'=>[
        1 => [
            'question'=>'史伟莎技术人员着装是否整齐?',
            'type'=>'radio',
        ],
        2 => [
            'question'=>'服务前史伟莎技术人员是否主动了解门店情况?',
            'type'=>'radio',
        ],
        3 => [
            'question'=>'服务完成后史伟莎技术人员是否汇报本次服务情况?',
            'type'=>'radio',
        ],
    ]
];